#+TITLE: UPSERT : insert or update
#+SETUPFILE: publish-html.org
#+INCLUDE: html-navbar.org

** /Function/ ~upsert_key(anyelement)~

#+name: function_upsert_key
#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output
  CREATE OR REPLACE FUNCTION upsert_key (anyelement)
  RETURNS json AS $$ 
   
    SELECT json_object_agg(pkey.name, pkey.type) FROM 
    (SELECT a.attname AS name, format_type(a.atttypid, a.atttypmod) AS type
     FROM   pg_index i
     JOIN   pg_attribute a ON a.attrelid = i.indrelid
     AND a.attnum = ANY(i.indkey)
     WHERE  i.indrelid = pg_typeof($1)::text::regclass -- ::regclass
     AND    i.indisprimary) AS pkey
  $$ LANGUAGE SQL;
#+END_SRC

#+RESULTS: function_upsert
: CREATE FUNCTION

*** Example

#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output table
  SELECT "update_set"(json('{"test":"2","number":122,"date":"2002-02-02","time":"2002-02-02T02:22:00","bool":false}'));
#+END_SRC

#+RESULTS:
| update_set                                                                                  |
|---------------------------------------------------------------------------------------------|
| test = '2', number = 122, date = '2002-02-02', "time" = '2002-02-02T02:22:00', bool = false |


** /Function/ ~update_where(anyelement, json)~

#+name: function_update_where
#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output
  CREATE OR REPLACE FUNCTION "update_where"(anyelement, json)
  RETURNS text AS $$ 
  SELECT "where"((SELECT (SELECT json_object_agg(key, (json)->>(key)) FROM json_each(keys))
                           FROM (SELECT $2 AS json, (SELECT upsert_key($1) AS keys)) AS base));
  $$ LANGUAGE SQL;
#+END_SRC

#+RESULTS:
: CREATE FUNCTION

*** Example
#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output table
  SELECT "update_where"(null::test, json('{"test":"2","number":122,"date":"2002-02-02","time":"2002-02-02T02:22:00","bool":false}'));
#+END_SRC


| update_where   |
|----------------|
| ((test = '2')) |

#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output table
    BEGIN; 
    CREATE FUNCTION upsert_key(test) RETURNS json AS $$ 
     SELECT json('{"number" : "number", "date" : "date"}');
    $$ LANGUAGE SQL ;

   SELECT "update_where"(null::test, json('{"test":"2","number":122,"date":"2002-02-02","time":"2002-02-02T02:22:00","bool":false}'));
   
   DROP FUNCTION upsert_key(test);
   END;
#+END_SRC

#+RESULTS:
| BEGIN                                        |
|----------------------------------------------|
| CREATE FUNCTION                              |
| update_where                                 |
| ((number = '122') AND (date = '2002-02-02')) |
| DROP FUNCTION                                |
| COMMIT                                       |

*** Example
#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output table
  SELECT "update_query"(null::test, json('{"test":"2","number":12,"date":"2002-02-02","time":"2002-02-02T02:22:00","bool":false}'));
#+END_SRC

#+RESULTS:
| CREATE FUNCTION                                                                                                                                           |
|-----------------------------------------------------------------------------------------------------------------------------------------------------------|
| update_query                                                                                                                                              |
| UPDATE test SET test = '2', number = 12, date = '2002-02-02', "time" = '2002-02-02T02:22:00', bool = false WHERE ((test = '2')) RETURNING to_json(test.*) |

*** Example
#+HEADER: :engine postgresql :cmdline "--host localhost --user pongo pongo_test"   
#+BEGIN_SRC sql :results output table
  SELECT "update"(null::test, json('{"test":"2334","number":2,"date":"1111-02-02","time":"4242-02-02T02:22:00","bool":true}'));
#+END_SRC

#+RESULTS:
| update                                                                                  |
|-----------------------------------------------------------------------------------------|
| {"test":"2334","number":2,"date":"1111-02-02","time":"4242-02-02T02:22:00","bool":true} |


